# Install
# sh -c "$(curl -fsSL https://raw.githubusercontent.com/Linuxbrew/install/master/install.sh)"

cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/bundle"
tap "homebrew/cask"

#
# Build tools
#

brew "gcc"
brew "autoconf"
brew "automake"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "libxml2"
brew "openssl"

#
# Networking
#

brew "nmap"
brew "httping"
brew "httpie"
brew "curl"
brew "siege"
brew "wrk"
brew "wget"

#
# Git tools
#

brew "git"
brew "git-lfs"
brew "diff-so-fancy"
brew "git-crypt"
brew "hub"
brew "gist"

#
# Encryption
#

brew "gpg2"
brew "gpg-suite"

#
# Containers
#

brew "docker-compose"
brew "docker-credential-osxkeychain"
brew "docker-machine"
brew "kubernetes-cli"
brew "helm"
cask "minikube"
cask "docker"

#
# Languages
#

brew "go"
brew "python"
brew "nodejs"

#
# Binaries
#

brew "fzf"
brew "fzf-tmux"
brew "tmux"
brew "asciinema"
brew "buku"
brew "jq"
brew "watch"
brew "ripgrep"
brew "kops"
brew "nnn"

#
# Services
#

brew "postgres", restart_service: true
brew "mysql", restart_service: true
brew "dnsmasq", restart_service: true

#
# Applications
#

cask "atom"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "slack"
cask "keybase"
cask "discord"
cask "iterm2"
